app/Rules/AllPoints.php

select `competencies`.*, `form_competency`.`form_id` as `pivot_form_id`, `form_competency`.`competency_id` as `pivot_competency_id` from `competencies` inner join `form_competency` on `competencies`.`id` = `form_competency`.`competency_id` where `form_competency`.`form_id` = 1 and `competencies`.`deleted_at` is null
---
    public function passes($attribute, $value)
    {
        // Count criteria only included in submited Form (report)
        $form = Form::find($value->form_id);
        $competencies = $form->competency->load(['criterion']);