app/Models/Form.php

select count(*) as aggregate from `reports` where `form_id` = 1 and `reports`.`deleted_at` is null
---
    public function getHasReportsAttribute()
    {
        return (Report::where('form_id', $this->id)->count() > 0) ? true : false;