app/Models/Report.php

    public function evaluationSet()
    {
        $evaluation_set = $this->evaluation->groupBy('criterionWithTrashed.competency.title');
        foreach ($evaluation_set as $id => $competency) {
            $competency->competency_id = ($competency->first()->criterionWithTrashed->competency_id ?? 0);
            $notes = $this->competencyNote()->where('competency_id', $competency->competency_id);
            $competency->competency_note = (
                $notes->count() > 0 ?
                $this->competencyNote->where('competency_id', $competency->competency_id)->first()->text
                :
                null
            );
---
select * from `evaluations` where `evaluations`.`report_id` = 24 and `evaluations`.`report_id` is not null and `evaluations`.`deleted_at` is null
select * from `competencies` where `competencies`.`id` in (1, 2, 3, 4, 5)
select * from `competency_notes` where `competency_notes`.`report_id` = 24 and `competency_notes`.`report_id` is not null and `competency_notes`.`deleted_at` is null