app/Http/Controllers/Admin/CompetencyController.php

select * from `competencies` where `competencies`.`id` in (1, 2, 3, 4, 5)
---
    public function index()
    {
        abort_unless(\Gate::allows('criterion_access'), 403);

        $competencies = Competency::with('criterion')->get();

update `competencies` set `title` = 'Pasirengimas egzaminui', `competencies`.`updated_at` = '2021-01-30 15:21:36' where `id` = 2
---
    public function update(StoreCompetencyRequest $request, Competency $competency)
    {
        abort_unless(\Gate::allows('criterion_edit'), 403);

        $competency->update($request->all());