app/Http/Controllers/Admin/FormController.php

    public function index()
    {
        $forms = Form::with('competency')->get();
---
select * from `forms` where `forms`.`deleted_at` is null
select `competencies`.*, `form_competency`.`form_id` as `pivot_form_id`, `form_competency`.`competency_id` as `pivot_competency_id` from `competencies` inner join `form_competency` on `competencies`.`id` = `form_competency`.`competency_id` where `form_competency`.`form_id` in (1, 2) and `competencies`.`deleted_at` is null

    public function create()
    {
        $worktypes = Worktype::pluck('title', 'id');
        $competencies = Competency::whereHas('criterion')->get();
---
select * from `competencies` where exists (select * from `criteria` where `competencies`.`id` = `criteria`.`competency_id` and `criteria`.`deleted_at` is null) and `competencies`.`deleted_at` is null

    public function destroy(Form $form)
    {
        // check reports, just in case
        $reports = Report::where('form_id', $form)->get();
---
select * from `reports` where `form_id` = '{\"id\":4,\"worktype_id\":1,\"title\":\"dfsgf\",\"version\":\"sdgb\",\"active\":0,\"created_at\":\"2021-01-30T13:16:37.000000Z\",\"updated_at\":\"2021-01-30T13:16:37.000000Z\",\"deleted_at\":null}' and `reports`.`deleted_at` is null