app/Http/Controllers/Admin/PermissionController.php

    public function index()
    {
        $permissions = Permission::all();
---
select * from `permissions` where `permissions`.`deleted_at` is null

    public function destroy(Permission $permission)
    {
        $permission->delete();
---
update `permissions` set `deleted_at` = '2021-01-30 17:38:04', `permissions`.`updated_at` = '2021-01-30 17:38:04' where `id` = 6