app/Http/Controllers/Admin/ReportsController.php

select `competencies`.*, `form_competency`.`form_id` as `pivot_form_id`, `form_competency`.`competency_id` as `pivot_competency_id` from `competencies` inner join `form_competency` on `competencies`.`id` = `form_competency`.`competency_id` where `form_competency`.`form_id` = 1 and `competencies`.`deleted_at` is null
select * from `drivecategories` where `drivecategories`.`deleted_at` is null
select * from `observing_types` where `observing_types`.`deleted_at` is null
---
    public function create()
    {
        abort_unless(\Gate::allows('report_create'), 403);

        $form = Form::find(1); // ToDo: get id from request
        $competencies = $form->competency->load(['criterion']);
        $users = User::all()->pluck('name', 'id')->prepend('---', '');
        $drivecategories = Drivecategory::all();
        $observing_types = ObservingType::all();

select * from `drivecategories` where `drivecategories`.`deleted_at` is null
select * from `observing_types` where `observing_types`.`deleted_at` is null
---
    public function edit(Report $report)
    {
        abort_unless(\Gate::allows('report_create', $report), 403);

        $users = User::all()->pluck('name', 'id')->prepend('---', '');

        $drivecategories = Drivecategory::all();
        $observing_types = ObservingType::all();