app/Http/Controllers/Admin/ReportController.php

    public function create()
    {
        $forms = Form::where('active', true)->get();
---
select * from `forms` where `active` = 1 and `id` = '1' and `forms`.`deleted_at` is null limit 1

    public function createByForm($id)
    {
        if (! \Gate::allows('create', Report::class)) {
            abort(403);
        }

        $form = Form::where('active', 1)->where('id', $id)->first();
        $competencies = $form->competency->load(['criterion']);
---
select `competencies`.*, `form_competency`.`form_id` as `pivot_form_id`, `form_competency`.`competency_id` as `pivot_competency_id` from `competencies` inner join `form_competency` on `competencies`.`id` = `form_competency`.`competency_id` where `form_competency`.`form_id` = 1 and `competencies`.`deleted_at` is null

    public function edit(Report $report)
    {
        $users = User::all()->pluck('name', 'id')->prepend('---', '');

        $drivecategories = Drivecategory::pluck('title', 'id')->prepend('---', '');
        $observing_types = ObservingType::all();
---
select * from `observing_types` where `observing_types`.`deleted_at` is null

    public function update(UpdateReportRequest $request, Report $report)
    {
        $report->update($request->except('form_id'));
---
update `reports` set `drivecategory_id` = '2', `reports`.`updated_at` = '2021-01-30 18:13:21' where `id` = 15

    public function show(Report $report)
    {
        // Only employee, observer, manager can view report
        $evaluation_set = $report->evaluationSet();

        if (auth()->user()->id === $report->employee_id) {
            $report->update([
                'employee_reviewed_at' => Carbon::now()->format('Y-m-d H:i:s')
            ]);
---
update `reports` set `employee_reviewed_at` = '2021-01-30 21:00:41', `reports`.`updated_at` = '2021-01-30 21:00:41' where `id` = 195

    public function destroy(Report $report)
    {
        $report->evaluation()->delete();
---
update `reports` set `deleted_at` = '2021-01-30 18:38:05', `reports`.`updated_at` = '2021-01-30 18:38:05' where `id` = 15