app/Http/Controllers/Admin/RoleController.php

    public function index()
    {
        $roles = Role::all();
---
select * from `roles` where `roles`.`deleted_at` is null

    public function edit(Role $role)
    {
         $permissions = Permission::all()->pluck('title', 'id');

        $role->load('permissions');
---
select `permissions`.*, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_role` on `permissions`.`id` = `permission_role`.`permission_id` where `permission_role`.`role_id` in (1) and `permissions`.`deleted_at` is null