app/Http/Controllers/Admin/RolesController.php

select * from `roles` where `roles`.`deleted_at` is null
---
    public function index()
    {
        abort_unless(\Gate::allows('is_admin'), 403);

        $roles = Role::all();

select `permissions`.*, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_role` on `permissions`.`id` = `permission_role`.`permission_id` where `permission_role`.`role_id` in (1) and `permissions`.`deleted_at` is null
---
    public function edit(Role $role)
    {
        abort_unless(\Gate::allows('is_admin'), 403);

        $permissions = Permission::all()->pluck('title', 'id');

        $role->load('permissions');