app/Http/Controllers/Admin/StatsController.php

    public function getMultiFilterSelectData()
    {
        $users = User::select(['id', 'name', 'email', 'created_at', 'updated_at'])->get();
---
select `name` from `users` where `users`.`deleted_at` is null