app/Http/Controllers/Admin/StatsController.php

    public function index(Request $request, HtmlBuilder $builder)
    {
        //return "Still in progress";

        $worktypes = Worktype::pluck('title', 'id')->prepend('---', '');
        $branches = Branch::pluck('title', 'id')->prepend('---', '');

        if (request()->ajax()) {
            $users = DataTables::of(User::query()->whereHas('branch', function (Builder $query_branch) use ($request) {
                if ($request->filled('branch_id')) {
                    $query_branch->where('id', $request->branch_id);
                }
            })
            ->with('branch')
            ->withCount(['reportAsEmployee' => function ($query_dates) use ($request) {
                if ($request->filled('date_from')) {
                    $query_dates->where('observing_date', '>=', $request->date_from);
                }
                if ($request->filled('date_to')) {
                    $query_dates->where('observing_date', '<=', $request->date_to);
                }
            }]))
            ->with('params', ['from' => $request->date_from, 'to' => $request->date_to, 'branch' => Branch::find($request->branch_id)->title ?? null])
            ->toJson();
---
select * from `branches` where 0 = 1 and `branches`.`deleted_at` is null