app/Http/Controllers/Admin/UsersController.php

    public function destroy(User $user)
    {
        abort_unless(\Gate::allows('user_edit'), 403);

        $user->delete();
---
update `users` set `deleted_at` = '2021-01-30 14:02:30', `users`.`updated_at` = '2021-01-30 14:02:30' where `id` = 157