app/Http/Controllers/Admin/UserController.php

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (422) and `roles`.`deleted_at` is null
---
    public function show(User $user)
    {
        $user->load('roles');