app/Http/Controllers/Admin/UsersController.php

    public function index()
    {
        abort_unless(\Gate::allows('user_access'), 403);

        $users = User::all();
---
select * from `users` where `users`.`deleted_at` is null